[
  {
    "image": "https://logo.clearbit.com/google.com",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 1,
    "description": "Google Maps is a comprehensive navigation and mapping service that helps users explore the world with ease. It offers real-time GPS tracking and step-by-step directions for driving, walking, cycling, or public transportation. You can view live traffic updates, reroute automatically to avoid congestion, and discover alternative paths instantly. Explore millions of businesses, restaurants, and landmarks nearby with detailed information, reviews, and photos. Street View allows you to virtually walk through streets and neighborhoods anywhere on the planet. Offline maps enable seamless navigation even without internet connectivity. The app integrates with Google Search and Assistant for smart voice-based queries. You can also share locations and estimated times of arrival with friends or family. With regular updates, Google Maps continues to evolve as the ultimate navigation companion trusted by millions worldwide.",
    "size": 85,
    "reviews": 32000000,
    "ratingAvg": 4.5,
    "downloads": 12,
    "ratings": [
      {
        "name": "1 star",
        "count": 500000
      },
      {
        "name": "2 star",
        "count": 800000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 24000000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/spotify.com",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 2,
    "description": "Spotify is a leading music and podcast streaming platform that connects millions of artists with listeners around the world. It offers a vast catalog of songs across every genre imaginable, from timeless classics to trending hits. Personalized playlists like Discover Weekly and Daily Mix adapt to your taste with advanced algorithms. The app supports offline downloads, so you can enjoy your favorite tracks anytime, anywhere. Users can follow artists, create custom playlists, and share them with friends. With Spotify Premium, experience ad-free listening, higher audio quality, and unlimited skips. Spotify also features exclusive podcasts, live sessions, and video content for an immersive experience. Integration with smart speakers, TVs, and cars makes it accessible on all devices. Constant updates ensure smoother performance, fresh content, and an evolving music journey tailored uniquely for you.",
    "size": 92,
    "reviews": 27000000,
    "ratingAvg": 4.6,
    "downloads": 8,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 600000
      },
      {
        "name": "3 star",
        "count": 1200000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 20000000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/facebook.com",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Facebook is one of the world’s largest social networking platforms that connects billions of people globally. Users can share life moments through photos, videos, and stories visible to friends and followers. It’s a space to stay informed, join communities, and participate in meaningful conversations. The app enables real-time messaging through Messenger, along with voice and video calls. Businesses and creators can promote brands, run ads, and engage with audiences easily. Facebook Watch offers an endless stream of videos and live broadcasts. Marketplace allows local buying and selling of goods securely. Privacy tools let users control their content visibility and data usage. With continuous innovation, Facebook fosters connection, collaboration, and community across generations, making it an integral part of daily digital life.",
    "size": 120,
    "reviews": 110000000,
    "ratingAvg": 4.1,
    "downloads": 14,
    "ratings": [
      {
        "name": "1 star",
        "count": 15000000
      },
      {
        "name": "2 star",
        "count": 7000000
      },
      {
        "name": "3 star",
        "count": 10000000
      },
      {
        "name": "4 star",
        "count": 25000000
      },
      {
        "name": "5 star",
        "count": 52000000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/microsoft.com",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 4,
    "description": "Microsoft Teams is a powerful collaboration platform built to simplify communication and teamwork across organizations. It integrates chat, video meetings, file sharing, and app collaboration into one workspace. Teams lets you host secure video conferences with screen sharing, background effects, and real-time captions. Channels organize conversations by topic or project, ensuring clarity and focus. Users can edit and co-author documents together using Office 365 apps like Word, Excel, and PowerPoint directly inside Teams. Notifications, mentions, and custom emojis make collaboration more human and interactive. Enterprise-level security ensures all communication remains protected. The app supports integration with hundreds of third-party tools for better productivity. Microsoft Teams bridges distances and brings global teams together in one unified environment for seamless hybrid work.",
    "size": 135,
    "reviews": 8500000,
    "ratingAvg": 4.3,
    "downloads": 5,
    "ratings": [
      {
        "name": "1 star",
        "count": 300000
      },
      {
        "name": "2 star",
        "count": 500000
      },
      {
        "name": "3 star",
        "count": 1000000
      },
      {
        "name": "4 star",
        "count": 2500000
      },
      {
        "name": "5 star",
        "count": 4200000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/netflix.com",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 5,
    "description": "Netflix is a world-leading streaming service offering a massive library of award-winning TV shows, movies, anime, and documentaries. Subscribers enjoy unlimited entertainment without ads, anytime and anywhere. The platform’s personalized recommendations suggest titles based on your viewing habits. You can download episodes and films for offline viewing while traveling. Netflix Originals bring exclusive content like Stranger Things, The Crown, and Money Heist that define pop culture. Multiple profiles allow family members to maintain individual preferences. Parental controls and content filters ensure a safe experience for children. The app supports high-definition and 4K streaming for ultimate clarity. Constantly updated with fresh releases, Netflix turns every device into a personal cinema experience for global audiences.",
    "size": 105,
    "reviews": 25000000,
    "ratingAvg": 4.4,
    "downloads": 10,
    "ratings": [
      {
        "name": "1 star",
        "count": 800000
      },
      {
        "name": "2 star",
        "count": 1000000
      },
      {
        "name": "3 star",
        "count": 2500000
      },
      {
        "name": "4 star",
        "count": 6000000
      },
      {
        "name": "5 star",
        "count": 14700000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/amazon.com",
    "title": "Amazon Shopping",
    "companyName": "Amazon.com, Inc.",
    "id": 6,
    "description": "Amazon Shopping brings the world’s largest marketplace to your fingertips with millions of products across every category imaginable. Browse everything from electronics and fashion to groceries and home essentials in one intuitive app. Personalized recommendations help you discover deals tailored to your preferences. Real-time tracking lets you follow your package from warehouse to doorstep. Users can read verified reviews, compare prices, and shop confidently using secure payment options. Prime members enjoy exclusive discounts, lightning-fast delivery, and access to streaming perks. The app also supports voice shopping with Alexa integration for hands-free convenience. Returns are quick and hassle-free with transparent refund policies. Constant updates ensure faster performance, new features, and an even smoother shopping experience wherever you go.",
    "size": 82,
    "reviews": 30000000,
    "ratingAvg": 4.5,
    "downloads": 9,
    "ratings": [
      {
        "name": "1 star",
        "count": 600000
      },
      {
        "name": "2 star",
        "count": 900000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 7000000
      },
      {
        "name": "5 star",
        "count": 19500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/zoom.us",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications, Inc.",
    "id": 7,
    "description": "Zoom Cloud Meetings redefines remote collaboration with crystal-clear video conferencing, webinars, and virtual events. Host or join meetings instantly with HD audio and video quality that scales to your connection. Features like screen sharing, breakout rooms, and live transcription enhance productivity and engagement. Businesses, educators, and communities use Zoom to stay connected regardless of distance. The app integrates seamlessly with calendars and productivity tools like Outlook and Google Workspace. Background filters, reactions, and whiteboards bring a personal touch to digital meetings. Security enhancements such as encryption and waiting rooms protect your sessions. With regular updates, Zoom continues to innovate, ensuring seamless communication for both professional and personal use worldwide.",
    "size": 78,
    "reviews": 19000000,
    "ratingAvg": 4.3,
    "downloads": 6,
    "ratings": [
      {
        "name": "1 star",
        "count": 700000
      },
      {
        "name": "2 star",
        "count": 800000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 10500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/twitter.com",
    "title": "X (Twitter)",
    "companyName": "X Corp.",
    "id": 8,
    "description": "X, formerly known as Twitter, is the global platform for real-time conversation, breaking news, and cultural moments. Users can post updates, share opinions, and follow trends shaping the world. From journalists to creators, millions use X to amplify voices and discover what’s happening instantly. The timeline adapts to your interests, showing top discussions, live sports updates, and viral content. Engage with communities through posts, replies, polls, and media sharing. Verified accounts, Spaces for live audio chat, and video uploads enrich social interaction. Businesses and public figures use X for announcements and outreach at scale. With a balance of entertainment and information, X keeps users connected to the pulse of the planet every second.",
    "size": 80,
    "reviews": 21000000,
    "ratingAvg": 4.0,
    "downloads": 7,
    "ratings": [
      {
        "name": "1 star",
        "count": 3000000
      },
      {
        "name": "2 star",
        "count": 1500000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 4500000
      },
      {
        "name": "5 star",
        "count": 10000000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/tiktok.com",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 9,
    "description": "TikTok revolutionizes social entertainment with its short-form video platform powered by creativity and discovery. Users can create engaging clips with music, filters, and effects that inspire millions. The personalized For You feed curates videos tailored to your interests using advanced AI. TikTok supports challenges, trends, and global movements that shape digital culture. Creators can grow audiences, collaborate, and monetize content through live streaming and brand partnerships. In-app editing tools make production simple and powerful for everyone. The platform fosters positivity, diversity, and self-expression among its global community. Parental controls and screen-time management promote healthy engagement. TikTok continues to redefine storytelling for a new generation of creators and viewers worldwide.",
    "size": 110,
    "reviews": 45000000,
    "ratingAvg": 4.4,
    "downloads": 15,
    "ratings": [
      {
        "name": "1 star",
        "count": 2500000
      },
      {
        "name": "2 star",
        "count": 2000000
      },
      {
        "name": "3 star",
        "count": 4000000
      },
      {
        "name": "4 star",
        "count": 9000000
      },
      {
        "name": "5 star",
        "count": 27500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/snapchat.com",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 10,
    "description": "Snapchat offers a fun and spontaneous way to connect through pictures, videos, and stories that disappear after viewing. The camera opens directly into creativity, letting users capture moments instantly with filters, lenses, and AR effects. Chat, call, or video-chat with friends individually or in groups with expressive Bitmojis. Discover tab brings trending news, shows, and creator content curated just for you. Snap Map allows you to explore what’s happening around the world in real time. Memories safely store your favorite snaps for later. Privacy remains central, giving users full control over who sees what. With frequent updates introducing new AR features and fun lenses, Snapchat keeps communication playful, personal, and fresh.",
    "size": 95,
    "reviews": 22000000,
    "ratingAvg": 4.2,
    "downloads": 11,
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 1200000
      },
      {
        "name": "3 star",
        "count": 2500000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 11300000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/adobe.com",
    "title": "Adobe Lightroom",
    "companyName": "Adobe Inc.",
    "id": 11,
    "description": "Adobe Lightroom is a professional photo editing and management tool designed for photographers and enthusiasts alike. The app offers powerful editing sliders, presets, and AI-driven tools to transform ordinary shots into stunning visuals. Cloud storage ensures your photos are synced across devices seamlessly. Users can organize albums, rate images, and apply consistent styles with ease. Lightroom supports RAW photo editing, color grading, and lens correction for precision control. Built-in tutorials and guided edits help beginners learn professional techniques quickly. You can share finished projects directly to social media or Adobe Creative Cloud. With its combination of performance, flexibility, and creativity, Lightroom remains the go-to mobile editor for photographers worldwide.",
    "size": 88,
    "reviews": 9000000,
    "ratingAvg": 4.6,
    "downloads": 4,
    "ratings": [
      {
        "name": "1 star",
        "count": 150000
      },
      {
        "name": "2 star",
        "count": 200000
      },
      {
        "name": "3 star",
        "count": 600000
      },
      {
        "name": "4 star",
        "count": 2000000
      },
      {
        "name": "5 star",
        "count": 6050000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/paypal.com",
    "title": "PayPal",
    "companyName": "PayPal Holdings, Inc.",
    "id": 12,
    "description": "PayPal provides a fast, safe, and global way to send and receive money across borders. Users can transfer funds to friends, pay for online purchases, or receive payments for business transactions securely. Built-in buyer protection gives peace of mind during shopping. The app allows you to store multiple cards, manage balances, and withdraw directly to your bank. QR code payments make in-store checkout effortless. PayPal’s encryption and fraud detection keep every transaction protected. You can split bills, set reminders, or send gifts with personalized messages. International support covers dozens of currencies and markets. Whether for business or daily life, PayPal remains the trusted name in digital finance worldwide.",
    "size": 70,
    "reviews": 13000000,
    "ratingAvg": 4.2,
    "downloads": 3,
    "ratings": [
      {
        "name": "1 star",
        "count": 1000000
      },
      {
        "name": "2 star",
        "count": 800000
      },
      {
        "name": "3 star",
        "count": 1500000
      },
      {
        "name": "4 star",
        "count": 4000000
      },
      {
        "name": "5 star",
        "count": 5700000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/whatsapp.com",
    "title": "WhatsApp Messenger",
    "companyName": "WhatsApp LLC",
    "id": 13,
    "description": "WhatsApp Messenger is a simple, reliable, and secure communication platform used by billions globally. Send messages, voice notes, photos, videos, and documents instantly over Wi-Fi or mobile data. End-to-end encryption ensures your privacy in every chat. Enjoy high-quality voice and video calls with individuals or groups of up to hundreds of participants. WhatsApp Web connects seamlessly with desktop browsers for multitasking. Status updates let you share daily moments with your contacts. Group features enable communities, families, and businesses to stay connected in one place. The app also provides payment options in select regions for easy money transfers. Lightweight design and constant updates keep it fast, safe, and accessible for everyone.",
    "size": 60,
    "reviews": 160000000,
    "ratingAvg": 4.6,
    "downloads": 14,
    "ratings": [
      {
        "name": "1 star",
        "count": 5000000
      },
      {
        "name": "2 star",
        "count": 3000000
      },
      {
        "name": "3 star",
        "count": 7000000
      },
      {
        "name": "4 star",
        "count": 20000000
      },
      {
        "name": "5 star",
        "count": 125000000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/telegram.org",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 14,
    "description": "Telegram is a cloud-based messaging app built for speed, security, and reliability. It allows users to send messages, photos, files, and videos of any size with ease. Secret Chats feature end-to-end encryption and self-destructing messages for privacy. Telegram Channels and Groups can host millions of members for large-scale communication. The app’s bots and API empower developers to create smart assistants and automation tools. Multi-device sync ensures you can access messages anywhere instantly. Custom themes, stickers, and emojis let users personalize their experience. Telegram prioritizes freedom of speech while combating spam with smart moderation tools. Constant updates keep Telegram a pioneer in privacy-focused communication worldwide.",
    "size": 75,
    "reviews": 13000000,
    "ratingAvg": 4.5,
    "downloads": 9,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 700000
      },
      {
        "name": "3 star",
        "count": 1000000
      },
      {
        "name": "4 star",
        "count": 3000000
      },
      {
        "name": "5 star",
        "count": 7900000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/discord.com",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 15,
    "description": "Discord is a vibrant communication platform that connects people through text, voice, and video. Originally built for gamers, it has evolved into a hub for communities of all kinds. Users can create servers with channels for organized discussion. Voice channels allow seamless group chat without constant calls. Screen sharing and streaming tools make collaboration and content sharing effortless. With customizable roles and moderation tools, community leaders maintain safe, inclusive spaces. Integrations with Spotify, Twitch, and YouTube add fun interactivity. Discord Nitro enhances the experience with high-resolution streaming, extra emojis, and bigger uploads. Whether for gaming, education, or hobbies, Discord keeps people connected and engaged around shared passions.",
    "size": 90,
    "reviews": 15000000,
    "ratingAvg": 4.5,
    "downloads": 7,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 600000
      },
      {
        "name": "3 star",
        "count": 1000000
      },
      {
        "name": "4 star",
        "count": 3500000
      },
      {
        "name": "5 star",
        "count": 9500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/spotify.com",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 16,
    "description": "Spotify is the world’s leading music streaming platform, giving users instant access to millions of songs, albums, and podcasts. Create, share, and discover playlists for every mood and activity. Its recommendation engine learns your taste to suggest personalized mixes and new artists daily. Users can stream music online or download tracks for offline listening. Spotify Connect allows you to play music seamlessly across devices, from phones to smart TVs. Podcasts range from storytelling to education, featuring both global and local creators. The app also supports collaborative playlists and group sessions for shared listening experiences. Premium users enjoy ad-free streaming, unlimited skips, and higher audio quality. Spotify continues to innovate, redefining how people experience music and sound globally.",
    "size": 90,
    "reviews": 52000000,
    "ratingAvg": 4.6,
    "downloads": 18,
    "ratings": [
      {
        "name": "1 star",
        "count": 2500000
      },
      {
        "name": "2 star",
        "count": 1500000
      },
      {
        "name": "3 star",
        "count": 3000000
      },
      {
        "name": "4 star",
        "count": 8000000
      },
      {
        "name": "5 star",
        "count": 37000000
      }
    ]
  },
  {
  "image": "https://logo.clearbit.com/toggl.com",
  "title": "Toggl Track",
  "companyName": "Toggl OÜ",
  "id": 12,
  "description": "Toggl Track is a simple time-tracking tool that helps individuals and teams track work hours across projects. With features like idle detection, reminders, and detailed reporting, it allows you to understand how you spend your time and optimize productivity. Integrations with tools like Asana, Trello, Slack, and GitHub make Toggl ideal for collaborative teams. Light UI, offline mode, and cross-platform support (web, desktop, mobile) ensure tracking works wherever you are.",
  "size": 25,
  "reviews": 500000,
  "ratingAvg": 4.2,
  "downloads": 2,
  "ratings": [
    {
      "name": "1 star",
      "count": 20000
    },
    {
      "name": "2 star",
      "count": 15000
    },
    {
      "name": "3 star",
      "count": 50000
    },
    {
      "name": "4 star",
      "count": 200000
    },
    {
      "name": "5 star",
      "count": 215000
    }
  ]
}
,
  {
    "image": "https://logo.clearbit.com/microsoft.com",
    "title": "Microsoft Teams",
    "companyName": "Microsoft Corporation",
    "id": 18,
    "description": "Microsoft Teams is a comprehensive collaboration platform that unites chat, meetings, and file sharing under one roof. Teams helps organizations streamline communication across departments, whether remote or on-site. Schedule meetings, join video calls, or share presentations in seconds. Integrated Office apps like Word, Excel, and PowerPoint enhance productivity without switching tools. Channels organize discussions by topic for better workflow management. Security and compliance features make it ideal for enterprises and educational institutions. Users can customize notifications, backgrounds, and themes for personalized experiences. Integration with third-party apps like Trello and Jira expands its flexibility. Teams bridges the gap between communication and collaboration, driving efficiency in the modern digital workplace.",
    "size": 100,
    "reviews": 25000000,
    "ratingAvg": 4.3,
    "downloads": 9,
    "ratings": [
      {
        "name": "1 star",
        "count": 1500000
      },
      {
        "name": "2 star",
        "count": 1200000
      },
      {
        "name": "3 star",
        "count": 2500000
      },
      {
        "name": "4 star",
        "count": 6000000
      },
      {
        "name": "5 star",
        "count": 13700000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/slack.com",
    "title": "Slack",
    "companyName": "Slack Technologies LLC",
    "id": 19,
    "description": "Slack transforms workplace communication into an organized and engaging experience. Channels replace cluttered email threads, making team collaboration easier and faster. Users can send messages, share files, or start video calls in a click. Integrations with tools like Google Drive, Asana, and GitHub make Slack a central hub for workflow. Advanced search and pinning features help teams find important information quickly. Notifications can be tailored to minimize distractions and maintain focus. Slack Connect allows communication across organizations securely. Emoji reactions, GIFs, and threads make work communication fun yet structured. With strong encryption and compliance standards, it’s built for teams of all sizes. Slack continues to be the heartbeat of modern digital collaboration.",
    "size": 85,
    "reviews": 10000000,
    "ratingAvg": 4.4,
    "downloads": 5,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 500000
      },
      {
        "name": "3 star",
        "count": 1000000
      },
      {
        "name": "4 star",
        "count": 2500000
      },
      {
        "name": "5 star",
        "count": 5600000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/reddit.com",
    "title": "Reddit",
    "companyName": "Reddit, Inc.",
    "id": 20,
    "description": "Reddit is a massive network of communities built around shared interests, hobbies, and passions. Users can join thousands of subreddits covering every imaginable topic — from tech and science to memes and movies. Upvotes and comments shape discussions democratically. The feed dynamically adjusts to your interests for a personalized browsing experience. Create posts, share media, or engage in debates with millions of active members. Reddit Premium removes ads and provides monthly coins for rewarding great content. The app’s redesign delivers a clean, easy-to-navigate interface. Moderators maintain quality discussions with robust tools. Whether you’re seeking knowledge, humor, or connection, Reddit offers endless engagement in the world’s largest digital forum.",
    "size": 75,
    "reviews": 12000000,
    "ratingAvg": 4.3,
    "downloads": 8,
    "ratings": [
      {
        "name": "1 star",
        "count": 800000
      },
      {
        "name": "2 star",
        "count": 900000
      },
      {
        "name": "3 star",
        "count": 1200000
      },
      {
        "name": "4 star",
        "count": 3000000
      },
      {
        "name": "5 star",
        "count": 6100000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/pinterest.com",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 21,
    "description": "Pinterest is your visual discovery engine, helping you find ideas and inspiration for every aspect of life. From fashion and home decor to recipes and travel, Pinterest brings creativity to your fingertips. Save Pins to organize your ideas in personalized boards. The app’s AI recommendations learn your style, suggesting new content daily. Visual search lets you find similar items just by using an image. Creators share tutorials, step-by-step guides, and trend forecasts. Shoppable Pins allow direct purchases from your favorite brands. The interface is clean and intuitive, encouraging endless exploration. Whether planning a wedding, a renovation, or your next adventure, Pinterest helps turn inspiration into reality.",
    "size": 70,
    "reviews": 9000000,
    "ratingAvg": 4.5,
    "downloads": 6,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 500000
      },
      {
        "name": "3 star",
        "count": 800000
      },
      {
        "name": "4 star",
        "count": 2500000
      },
      {
        "name": "5 star",
        "count": 4800000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/dropbox.com",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 22,
    "description": "Dropbox is a cloud storage solution that simplifies file management and collaboration. Upload, share, and sync files across all devices with ease. Automatic backup ensures your important documents, photos, and videos are always safe. Shared folders and real-time editing make teamwork effortless. Dropbox Paper provides a space for notes, projects, and brainstorming. Integration with Microsoft Office and Google Workspace allows seamless productivity. The app’s smart sync technology saves local storage while keeping files accessible. Users can scan documents, sign PDFs, and manage permissions directly. With enterprise-level security and intuitive design, Dropbox is trusted by individuals and organizations worldwide for secure, efficient file sharing.",
    "size": 65,
    "reviews": 8000000,
    "ratingAvg": 4.4,
    "downloads": 5,
    "ratings": [
      {
        "name": "1 star",
        "count": 300000
      },
      {
        "name": "2 star",
        "count": 400000
      },
      {
        "name": "3 star",
        "count": 900000
      },
      {
        "name": "4 star",
        "count": 2000000
      },
      {
        "name": "5 star",
        "count": 4400000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/evernote.com",
    "title": "Evernote",
    "companyName": "Evernote Corporation",
    "id": 23,
    "description": "Evernote helps you organize your life by capturing ideas, notes, and tasks in one powerful workspace. Create to-do lists, attach files, and scan documents effortlessly. Notes sync across devices instantly, ensuring you never lose track of important details. The app supports multimedia — type, draw, or record voice memos. Tags and notebooks make information easy to find. Integration with Google Calendar helps you manage schedules seamlessly. Evernote Web Clipper lets you save articles directly from your browser. The premium version offers offline access and expanded storage. With its balance of simplicity and depth, Evernote remains a trusted productivity tool for professionals, students, and creatives alike.",
    "size": 68,
    "reviews": 7500000,
    "ratingAvg": 4.2,
    "downloads": 4,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 500000
      },
      {
        "name": "3 star",
        "count": 800000
      },
      {
        "name": "4 star",
        "count": 2200000
      },
      {
        "name": "5 star",
        "count": 3600000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/duolingo.com",
    "title": "Duolingo",
    "companyName": "Duolingo Inc.",
    "id": 24,
    "description": "Duolingo makes learning languages fun, free, and effective with bite-sized lessons and gamified exercises. Choose from over 30 languages including Spanish, French, and Japanese. Lessons use listening, speaking, and reading challenges to reinforce retention. The app’s streak system and rewards encourage daily practice. AI-driven feedback adapts lessons to your learning pace. Leaderboards and challenges make it engaging for friends and family. Offline lessons allow learning anywhere. For advanced learners, Duolingo Max offers conversational AI and in-depth grammar review. Its friendly mascot, Duo, motivates you along the way. Loved by millions worldwide, Duolingo turns education into an enjoyable and rewarding daily habit.",
    "size": 55,
    "reviews": 42000000,
    "ratingAvg": 4.7,
    "downloads": 10,
    "ratings": [
      {
        "name": "1 star",
        "count": 1000000
      },
      {
        "name": "2 star",
        "count": 1500000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 32500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/ubereats.com",
    "title": "Uber Eats",
    "companyName": "Uber Technologies, Inc.",
    "id": 25,
    "description": "Uber Eats connects hungry customers with their favorite local restaurants for quick, convenient food delivery. Browse nearby eateries, explore menus, and place orders in seconds. Real-time GPS tracking shows your delivery progress from kitchen to door. Users can schedule future orders or reorder favorites with one tap. The app supports secure digital payments and tipping options. Personalized recommendations highlight trending dishes and offers near you. Restaurant partners benefit from expanded visibility and growth. With options for pickup and contactless delivery, Uber Eats suits every dining need. Its reliability, speed, and user-friendly design make it one of the most trusted food delivery platforms worldwide.",
    "size": 85,
    "reviews": 25000000,
    "ratingAvg": 4.3,
    "downloads": 13,
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 1000000
      },
      {
        "name": "3 star",
        "count": 2500000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 14500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/duolingo.com",
    "title": "Duolingo",
    "companyName": "Duolingo Inc.",
    "id": 26,
    "description": "Duolingo is a fun, gamified language-learning app designed to make mastering new languages simple and enjoyable. It offers interactive lessons that focus on reading, writing, speaking, and listening. Users can learn over 30 languages, including Spanish, French, Japanese, and German. The app’s bite-sized lessons make daily practice easy, even for busy schedules. With progress tracking, streaks, and rewards, Duolingo keeps learners motivated. The app’s AI adapts to each user’s strengths and weaknesses, offering personalized feedback. Learners can compete with friends through leaderboards to stay engaged. Offline lessons allow uninterrupted learning anywhere. Duolingo’s friendly mascot, Duo the owl, encourages consistency and fun. It’s a perfect tool for students, travelers, and anyone looking to expand linguistic horizons.",
    "size": 70,
    "reviews": 32000000,
    "ratingAvg": 4.7,
    "downloads": 15,
    "ratings": [
      {
        "name": "1 star",
        "count": 2000000
      },
      {
        "name": "2 star",
        "count": 1000000
      },
      {
        "name": "3 star",
        "count": 2500000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 14500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/snapchat.com",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 27,
    "description": "Snapchat is a fast, camera-first social app that lets users share moments through disappearing photos and videos. Its playful filters and AR lenses transform selfies into creative experiences. The Stories feature allows sharing daily highlights with friends or the world. Chatting on Snapchat includes Bitmojis, reactions, and audio/video calls. Snap Map helps users see where friends are hanging out in real-time. With Discover, users can explore trending news, entertainment, and creators. Memories save favorite Snaps privately for future viewing. Privacy is central — content vanishes by default, keeping conversations light and authentic. Businesses use Snapchat Ads and AR features to engage younger audiences. With constant innovation, Snapchat continues to redefine how people express themselves visually online.",
    "size": 95,
    "reviews": 28000000,
    "ratingAvg": 4.3,
    "downloads": 20,
    "ratings": [
      {
        "name": "1 star",
        "count": 1000000
      },
      {
        "name": "2 star",
        "count": 1500000
      },
      {
        "name": "3 star",
        "count": 2000000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 32500000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/telegram.org",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 28,
    "description": "Telegram is a cloud-based instant messaging app focused on speed, security, and flexibility. It supports unlimited file sharing, channels, and groups with up to 200,000 members. Users enjoy fast communication across devices with synchronized messages. End-to-end encryption ensures private chats stay protected. Telegram’s bots and APIs empower developers to build custom tools and automations. The app includes features like scheduled messages, folders, and custom themes. With minimal ads and no data sharing, it stands out for privacy-conscious users. Its secret chats offer self-destructing messages for extra security. Telegram also supports voice and video calls with crystal-clear quality. Lightweight and powerful, it’s a favorite among communities and professionals worldwide.",
    "size": 85,
    "reviews": 19000000,
    "ratingAvg": 4.6,
    "downloads": 12,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 500000
      },
      {
        "name": "3 star",
        "count": 800000
      },
      {
        "name": "4 star",
        "count": 2500000
      },
      {
        "name": "5 star",
        "count": 4800000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/airbnb.com",
    "title": "Airbnb",
    "companyName": "Airbnb, Inc.",
    "id": 29,
    "description": "Airbnb revolutionizes travel by connecting people to unique places to stay and local experiences. From cozy cabins to luxury villas, users can find accommodations for every style and budget. Hosts can list their properties easily and earn by sharing their spaces. The app includes verified reviews, secure payments, and 24/7 support for peace of mind. Travelers can book stays, discover local tours, and explore curated experiences. Smart filters help refine searches based on amenities, ratings, and location. Airbnb’s map view gives an instant overview of nearby listings. Its community-driven platform fosters trust between guests and hosts. Whether for weekend getaways or global adventures, Airbnb makes travel more personal and memorable. Sustainability and inclusivity remain at its core vision.",
    "size": 105,
    "reviews": 23000000,
    "ratingAvg": 4.8,
    "downloads": 18,
    "ratings": [
      {
        "name": "1 star",
        "count": 2500000
      },
      {
        "name": "2 star",
        "count": 1500000
      },
      {
        "name": "3 star",
        "count": 3000000
      },
      {
        "name": "4 star",
        "count": 8000000
      },
      {
        "name": "5 star",
        "count": 37000000
      }
    ]
  },
  {
    "image": "https://logo.clearbit.com/reddit.com",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 30,
    "description": "Reddit is a massive online community platform where users dive into endless topics through discussions, memes, and stories. It’s organized into thousands of subreddits dedicated to interests from science to gaming and art. Users can post text, images, or links, and others upvote or comment to share opinions. The home feed personalizes content based on engagement and subscriptions. Reddit fosters open conversation, knowledge exchange, and humor. Moderation tools help keep communities safe and relevant. The platform supports anonymous participation, giving everyone a voice. With live threads, AMAs (Ask Me Anything), and trending news, Reddit remains a real-time reflection of the internet’s pulse. It continues to evolve as a hub of digital culture and curiosity.",
    "size": 90,
    "reviews": 21000000,
    "ratingAvg": 4.4,
    "downloads": 14,
    "ratings": [
      {
        "name": "1 star",
        "count": 400000
      },
      {
        "name": "2 star",
        "count": 600000
      },
      {
        "name": "3 star",
        "count": 1200000
      },
      {
        "name": "4 star",
        "count": 5000000
      },
      {
        "name": "5 star",
        "count": 20000000
      }
    ]
  }
]